blog/2021/js-string.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 14:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>JS 字符串</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">JS 字符串</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#基本语法 1">0.1. 基本语法</a></li>
<li><a href="#例子 2">0.2. 例子</a></li>
</ul>
</li>
<li><a href="#orgdd751b2">1. 属性方法列表</a></div>
</nav>
<p>
<code>includes()</code> 方法能够在字符串中查找特定字符，而且它是大小写敏感的。
</p>


<div id="outline-container-基本语法 1" class="outline-3">
<h3 id="基本语法 1"><span class="section-number-3">0.1</span> 基本语法<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup></h3>
<div class="outline-text-3" id="text-基本语法 1">
<div class="org-src-container">
<pre class="src src-js">str.includes(searchString, optionalPosition)
</pre>
</div>

<p>
<code>searchString</code> 是要查找的字符；=optionalPosition=
是可选的，当它被赋为整数值 n 时，即从 n+1
位开始查找（空格也计入在内）。而且，=includes= 大小写敏感。
</p>
</div>
</div>

<div id="outline-container-例子 2" class="outline-3">
<h3 id="例子 2"><span class="section-number-3">0.2</span> 例子<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup></h3>
<div class="outline-text-3" id="text-例子 2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #ddbc91;">"I love you"</span>.includes(<span style="color: #ddbc91;">"love"</span>); <span style="color: #706565;">// </span><span style="color: #857575;">true</span>
<span style="color: #ddbc91;">"I LOVE you"</span>.includes(<span style="color: #ddbc91;">"love"</span>); <span style="color: #706565;">// </span><span style="color: #857575;">false</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">const</span> <span style="color: #aaca86;">str</span> = <span style="color: #ddbc91;">"I love you."</span>;

console.log(str.includes(<span style="color: #ddbc91;">"love"</span>)); <span style="color: #706565;">// </span><span style="color: #857575;">true</span>
console.log(str.includes(<span style="color: #ddbc91;">"love"</span>, 1)); <span style="color: #706565;">// </span><span style="color: #857575;">true</span>
console.log(str.includes(<span style="color: #ddbc91;">"love"</span>, 2)); <span style="color: #706565;">// </span><span style="color: #857575;">true</span>
console.log(str.includes(<span style="color: #ddbc91;">"love"</span>, 3)); <span style="color: #706565;">// </span><span style="color: #857575;">false</span>
console.log(str.includes(<span style="color: #ddbc91;">"love"</span>, 2.1)); <span style="color: #706565;">// </span><span style="color: #857575;">true</span>
console.log(str.includes(<span style="color: #ddbc91;">"love"</span>, 3.1)); <span style="color: #706565;">// </span><span style="color: #857575;">false</span>
</pre>
</div>

<p>
为什么当 <code>optionalPosition</code> 为浮点数 2.1 的时候依然返回 true？
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Str</th>
<th scope="col" class="org-right">Index</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">"I"</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">” ”</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">"love"</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-left">” ”</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-left">"you"</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-left">"."</td>
<td class="org-right">5</td>
</tr>
</tbody>
</table>

<p>
如上表所示，="love"= 字符串的索引为 2。
</p>
</div>
</div>

<div id="outline-container-orgdd751b2" class="outline-2">
<h2 id="orgdd751b2"><span class="section-number-2">1</span> 属性方法列表</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>属性
<ul class="org-ul">
<li>length</li>
</ul></li>
<li>方法
<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/includes">https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/includes</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.freecodecamp.org/news/javascript-string-contains-how-to-use-js-includes/">https://www.freecodecamp.org/news/javascript-string-contains-how-to-use-js-includes/</a>
</p></div></div>


</div>
</div></div>
</body>
</html>